zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K342_EMIOS.h
#define eMIOS_S_OVFL_MASK                        (0x8000U)
#define eMIOS_S_OVFL_SHIFT                       (15U)
#define eMIOS_S_OVFL_WIDTH                       (1U)
#define eMIOS_S_OVFL(x)                          (((uint32_t)(((uint32_t)(x)) << eMIOS_S_OVFL_SHIFT)) & eMIOS_S_OVFL_MASK)

#define eMIOS_S_OVR_MASK                         (0x80000000U)
#define eMIOS_S_OVR_SHIFT                        (31U)
#define eMIOS_S_OVR_WIDTH                        (1U)
#define eMIOS_S_OVR(x)                           (((uint32_t)(((uint32_t)(x)) << eMIOS_S_OVR_SHIFT)) & eMIOS_S_OVR_MASK)
/*! @} */

/*! @name ALTA - Alternate Address 0..Alternate Address 23 */
/*! @{ */

#define eMIOS_ALTA_ALTA_MASK                     (0xFFFFU)
#define eMIOS_ALTA_ALTA_SHIFT                    (0U)
#define eMIOS_ALTA_ALTA_WIDTH                    (16U)
#define eMIOS_ALTA_ALTA(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_ALTA_ALTA_SHIFT)) & eMIOS_ALTA_ALTA_MASK)
/*! @} */

/*! @name C2 - UC Control 2 0..UC Control 2 23 */
/*! @{ */

#define eMIOS_C2_UCRELDEL_INT_MASK               (0x1FU)
#define eMIOS_C2_UCRELDEL_INT_SHIFT              (0U)
#define eMIOS_C2_UCRELDEL_INT_WIDTH              (5U)
#define eMIOS_C2_UCRELDEL_INT(x)                 (((uint32_t)(((uint32_t)(x)) << eMIOS_C2_UCRELDEL_INT_SHIFT)) & eMIOS_C2_UCRELDEL_INT_MASK)

#define eMIOS_C2_UCPRECLK_MASK                   (0x4000U)
#define eMIOS_C2_UCPRECLK_SHIFT                  (14U)
#define eMIOS_C2_UCPRECLK_WIDTH                  (1U)
#define eMIOS_C2_UCPRECLK(x)                     (((uint32_t)(((uint32_t)(x)) << eMIOS_C2_UCPRECLK_SHIFT)) & eMIOS_C2_UCPRECLK_MASK)

#define eMIOS_C2_UCEXTPRE_MASK                   (0xF0000U)
#define eMIOS_C2_UCEXTPRE_SHIFT                  (16U)
#define eMIOS_C2_UCEXTPRE_WIDTH                  (4U)
#define eMIOS_C2_UCEXTPRE(x)                     (((uint32_t)(((uint32_t)(x)) << eMIOS_C2_UCEXTPRE_SHIFT)) & eMIOS_C2_UCEXTPRE_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group eMIOS_Register_Masks */

/*!
 * @}
 */ /* end of group eMIOS_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K342_eMIOS_H_) */
